src/test/resources/samples/request1.soap

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.integclaims.itf.com">
    <soapenv:Header/>
    <soapenv:Body>
        <ws:FindRefData soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
            <username xsi:type="xsd:string">username</username>
            <password xsi:type="xsd:string">password</password>
            <TABLE_NAME xsi:type="xsd:string">ref_data</TABLE_NAME>
            <PARENT_CODE xsi:type="xsd:string">PURPOSE_OF_JOURNEY</PARENT_CODE>
            <COMPANY_CODE xsi:type="xsd:string">NOIDEA</COMPANY_CODE>
            <FILTER_CODE xsi:type="xsd:string">RESPOND</FILTER_CODE>
            <addShowAllEntry xsi:type="xsd:boolean">false</addShowAllEntry>
            <showAllCompanyCodes xsi:type="xsd:boolean">false</showAllCompanyCodes>
            <exludeEmptyCompanyCodes xsi:type="xsd:boolean">false</exludeEmptyCompanyCodes>
            <exludeEmptyFilterCodes xsi:type="xsd:boolean">false</exludeEmptyFilterCodes>
            <enforceParentRlship xsi:type="xsd:boolean">false</enforceParentRlship>
            <extraCodeToAdd xsi:type="xsd:string">SDP</extraCodeToAdd>
        </ws:FindRefData>
    </soapenv:Body>
</soapenv:Envelope>
